In [63]:
# demostration on pandas

In [64]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [65]:
cols = ["name","age","gender","job"]
cols

['name', 'age', 'gender', 'job']

In [66]:
user1 = pd.DataFrame([["alice", 19,"f","student"],
                     ["john",26,"m","student"]], 
                     columns=cols)

In [67]:
user1

    name  age gender      job
0  alice   19      f  student
1   john   26      m  student

In [68]:
user2 = pd.DataFrame([["eric",22,"m","student"],
                     ["paul",58,"f","manager"]], 
                     columns=cols)

In [69]:
user2

   name  age gender      job
0  eric   22      m  student
1  paul   58      f  manager

In [70]:
user3 = pd.DataFrame(dict(name=["peter","julie"],
                         age=[33,44],gender=["m","f"],
                        job=["engineer","scientist"]))

In [71]:
user3

    name  age gender        job
0  peter   33      m   engineer
1  julie   44      f  scientist

In [72]:
# concatenating DataFrame
# user1.append(user2,ignore_index=True)
user1.append(user2)

    name  age gender      job
0  alice   19      f  student
1   john   26      m  student
0   eric   22      m  student
1   paul   58      f  manager

In [73]:
# users = pd.concat([user1,user2,user3],ignore_index = True)
users = pd.concat([user1,user2,user3])
users

    name  age gender        job
0  alice   19      f    student
1   john   26      m    student
0   eric   22      m    student
1   paul   58      f    manager
0  peter   33      m   engineer
1  julie   44      f  scientist

In [74]:
# joining of DataFrames
user4 = pd.DataFrame(dict(name=["alice","john","eric","julie"],
                         height=[165,180,175,171]))

In [75]:
user4

    name  height
0  alice     165
1   john     180
2   eric     175
3  julie     171

In [76]:
# inner join operation
merge_inter = pd.merge(users,user4,on="name")
merge_inter

    name  age gender        job  height
0  alice   19      f    student     165
1   john   26      m    student     180
2   eric   22      m    student     175
3  julie   44      f  scientist     171

In [77]:
merge_outer = pd.merge(users,user4,on="name",
                       how="outer")
merge_outer

    name  age gender        job  height
0  alice   19      f    student   165.0
1   john   26      m    student   180.0
2   eric   22      m    student   175.0
3   paul   58      f    manager     NaN
4  peter   33      m   engineer     NaN
5  julie   44      f  scientist   171.0

In [78]:
# examine the users data
users
type (users)
users.head()       # prints the first 5 rows
users.tail()       # prints the last 5 rows

    name  age gender        job
1   john   26      m    student
0   eric   22      m    student
1   paul   58      f    manager
0  peter   33      m   engineer
1  julie   44      f  scientist

In [79]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [80]:
users.index

Int64Index([0, 1, 0, 1, 0, 1], dtype='int64')

In [81]:
users.columns

Index(['name', 'age', 'gender', 'job'], dtype='object')

In [82]:
users.dtypes

name      object
age        int64
gender    object
job       object
dtype: object

In [83]:
users.shape

(6, 4)

In [84]:
users.values

array([['alice', 19, 'f', 'student'],
       ['john', 26, 'm', 'student'],
       ['eric', 22, 'm', 'student'],
       ['paul', 58, 'f', 'manager'],
       ['peter', 33, 'm', 'engineer'],
       ['julie', 44, 'f', 'scientist']], dtype=object)

In [85]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 1
Data columns (total 4 columns):
name      6 non-null object
age       6 non-null int64
gender    6 non-null object
job       6 non-null object
dtypes: int64(1), object(3)
memory usage: 240.0+ bytes

In [86]:
# summarizes all columns
users.describe(include="all")

        name        age gender      job
count      6   6.000000      6        6
unique     6        NaN      2        4
top     paul        NaN      m  student
freq       1        NaN      3        3
mean     NaN  33.666667    NaN      NaN
std      NaN  14.895189    NaN      NaN
min      NaN  19.000000    NaN      NaN
25%      NaN  23.000000    NaN      NaN
50%      NaN  29.500000    NaN      NaN
75%      NaN  41.250000    NaN      NaN
max      NaN  58.000000    NaN      NaN

In [87]:
# column wise selection
users["gender"]
users.gender
users[["age","gender"]]
my_cols = ["age","gender"]
users[my_cols]
type(users[my_cols])

pandas.core.frame.DataFrame

In [88]:
# row wise selection
df = users.copy()
df.iloc[0]        # printing the first row
df.iloc[0,0]

'alice'

In [89]:
df.iloc[0,0]=55
df.iloc[0]

name           55
age            19
gender          f
job       student
Name: 0, dtype: object

In [90]:
for i in range(df.shape[0]):
    df.iloc[i,0] *= 10
df

                                                name  age gender        job
0                                                550   19      f    student
1           johnjohnjohnjohnjohnjohnjohnjohnjohnjohn   26      m    student
0           ericericericericericericericericericeric   22      m    student
1           paulpaulpaulpaulpaulpaulpaulpaulpaulpaul   58      f    manager
0  peterpeterpeterpeterpeterpeterpeterpeterpeterp...   33      m   engineer
1  juliejuliejuliejuliejuliejuliejuliejuliejuliej...   44      f  scientist

In [91]:
df

                                                name  age gender        job
0                                                550   19      f    student
1           johnjohnjohnjohnjohnjohnjohnjohnjohnjohn   26      m    student
0           ericericericericericericericericericeric   22      m    student
1           paulpaulpaulpaulpaulpaulpaulpaulpaulpaul   58      f    manager
0  peterpeterpeterpeterpeterpeterpeterpeterpeterp...   33      m   engineer
1  juliejuliejuliejuliejuliejuliejuliejuliejuliej...   44      f  scientist

In [92]:
# row-wise selection and filtering
users[users.age < 20]

    name  age gender      job
0  alice   19      f  student

In [93]:
young_boolean = users.age < 20
young_boolean

0     True
1    False
0    False
1    False
0    False
1    False
Name: age, dtype: bool

In [94]:
users[young_boolean]

    name  age gender      job
0  alice   19      f  student

In [95]:
users[users.age < 20].job

0    student
Name: job, dtype: object

In [96]:
users[users.age < 20][["age","job"]]

   age      job
0   19  student

In [97]:
users[(users.age>20) & (users.gender=="m")]\
                                  [["age","gender"]]

   age gender
1   26      m
0   22      m
0   33      m

In [98]:
users[users.job.isin(["student","engineer"])]

    name  age gender       job
0  alice   19      f   student
1   john   26      m   student
0   eric   22      m   student
0  peter   33      m  engineer

In [99]:
# sorting operation
df = users.copy()
df.age.sort_values()

0    19
0    22
1    26
0    33
1    44
1    58
Name: age, dtype: int64

In [100]:
df.sort_values(by="age")

    name  age gender        job
0  alice   19      f    student
0   eric   22      m    student
1   john   26      m    student
0  peter   33      m   engineer
1  julie   44      f  scientist
1   paul   58      f    manager

In [101]:
df.sort_values(by="age",ascending=False)

    name  age gender        job
1   paul   58      f    manager
1  julie   44      f  scientist
0  peter   33      m   engineer
1   john   26      m    student
0   eric   22      m    student
0  alice   19      f    student

In [102]:
df.sort_values(by=["job","age"])

    name  age gender        job
0  peter   33      m   engineer
1   paul   58      f    manager
1  julie   44      f  scientist
0  alice   19      f    student
0   eric   22      m    student
1   john   26      m    student

In [103]:
df

    name  age gender        job
0  alice   19      f    student
1   john   26      m    student
0   eric   22      m    student
1   paul   58      f    manager
0  peter   33      m   engineer
1  julie   44      f  scientist

In [104]:
df.sort_values(by=["job","age"], inplace=True)

In [105]:
df

    name  age gender        job
0  peter   33      m   engineer
1   paul   58      f    manager
1  julie   44      f  scientist
0  alice   19      f    student
0   eric   22      m    student
1   john   26      m    student

In [106]:
# reshaping by pivoting
stacked = pd.melt(users,id_vars="name",
                  var_name="variable",
                  value_name="value")
stacked

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          f
7    john   gender          m
8    eric   gender          m
9    paul   gender          f
10  peter   gender          m
11  julie   gender          f
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist

In [107]:
stacked.pivot(index="name",columns="variable",
              values="value")

variable age gender        job
name
alice     19      f    student
eric      22      m    student
john      26      m    student
julie     44      f  scientist
paul      58      f    manager
peter     33      m   engineer

In [108]:
# quality control: dealing with duplicate data
print (df.duplicated())                 # series of boolean as output

0    False
1    False
1    False
0    False
0    False
1    False
dtype: bool

In [109]:
df.duplicated().sum()

0

In [110]:
df[df.duplicated()]               # it shows only duplicate rows

Empty DataFrame
Columns: [name, age, gender, job]
Index: []

df.job.duplicated()

In [111]:
df.duplicated(["age","gender"]).sum()

0

In [112]:
df = df.drop_duplicates()

In [113]:
# quality control: missing data

In [114]:
df = users.copy()
df.describe(include = "all")

        name        age gender      job
count      6   6.000000      6        6
unique     6        NaN      2        4
top     paul        NaN      m  student
freq       1        NaN      3        3
mean     NaN  33.666667    NaN      NaN
std      NaN  14.895189    NaN      NaN
min      NaN  19.000000    NaN      NaN
25%      NaN  23.000000    NaN      NaN
50%      NaN  29.500000    NaN      NaN
75%      NaN  41.250000    NaN      NaN
max      NaN  58.000000    NaN      NaN

In [115]:
# finding missing value in a series
df.isnull()

    name    age  gender    job
0  False  False   False  False
1  False  False   False  False
0  False  False   False  False
1  False  False   False  False
0  False  False   False  False
1  False  False   False  False

In [116]:
# attribute wise null count
df.isnull().sum()

name      0
age       0
gender    0
job       0
dtype: int64

In [117]:
# drop missing values
df.dropna()        # dropping rows having null 
                   # in any attribute

    name  age gender        job
0  alice   19      f    student
1   john   26      m    student
0   eric   22      m    student
1   paul   58      f    manager
0  peter   33      m   engineer
1  julie   44      f  scientist

In [118]:
df.dropna(how="all")     # droping rows if having 
                         # null in all attributes

    name  age gender        job
0  alice   19      f    student
1   john   26      m    student
0   eric   22      m    student
1   paul   58      f    manager
0  peter   33      m   engineer
1  julie   44      f  scientist

In [119]:
# rename values
df = users.copy()
df.columns

Index(['name', 'age', 'gender', 'job'], dtype='object')

In [120]:
df.columns=["new_name","new_age","new_gender","new_job"]

In [121]:
df

  new_name  new_age new_gender    new_job
0    alice       19          f    student
1     john       26          m    student
0     eric       22          m    student
1     paul       58          f    manager
0    peter       33          m   engineer
1    julie       44          f  scientist

In [122]:
# dealing with groupby
for grp, data in users.groupby("gender"):
    print(grp,"\n",data)

f
     name  age gender        job
0  alice   19      f    student
1   paul   58      f    manager
1  julie   44      f  scientist
m
     name  age gender       job
1   john   26      m   student
0   eric   22      m   student
0  peter   33      m  engineer

In [ ]:
# reading csv file on to DataFrame
import pandas as pd
try:
    pd1 = pd.read_csv("d:\MyData1.csv")
except:
    print ("File access error...")
    url = "https://raw.githubusercontent.com/neurospin/pystatsml/master/data/salary_table.csv"
    pd1 = pd.read_csv(url)
    
pd1